
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Перем Пользователи;
	Д_Ответственный = Пользователи.ТекущийПользователь();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Д_Договор = ДанныеЗаполнения.Договор;
		Д_Комментарий = ДанныеЗаполнения.Комментарий;
		Д_Контрагент = ДанныеЗаполнения.Контрагент;
		Д_Организация = ДанныеЗаполнения.Организация;
		Д_Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Д_Товары.Добавить();
			НоваяСтрока.Д_Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Д_Количество = ТекСтрокаТовары.Количество;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
